# St7GetDrawAreaPosition

Returns the screen position for drawing the model graphics within the model window.

long St7GetDrawAreaPosition(long uID, long* Left, long* Top, long* Width,
long* Height)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Left
Pixel position of the left edge of the model graphics.
Top
Pixel position of the top edge of the model graphics.
Width
Pixel width of the model graphics.
Height
Pixel height of the model graphics.